# Задача-1
a = 0
print(a)
b = input('Введите значение переменной')
print(b)

#Задача-2
a = int(input('Введите целое число'))
a = 2 + a
print(a)

#Задача-3
age = int(input("Введите ваш возраст"))

if age > 18:
    print('Доступ разрешен')
else:
    print('Извините, пользование данным ресурсом разрешено только с 18 лет')